title: Suspicious PowerShell Execution
description: Detects potentially malicious PowerShell execution.
status: experimental
author: Kevin Kern
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - "Invoke-Expression"
      - "IEX"
      - "DownloadString"
  condition: selection
falsepositives:
  - Administrative scripts
level: high
tags:
  - attack.t1059.001
